app/controllers/users_controller.rb

SELECT * FROM "snippets" WHERE ("snippets"."user" = 'jhyland') ORDER BY created_at DESC
---
  def show
    @user = params[:id]
    @snippets = Snippet.find_all_by_user(@user, :order => 'created_at DESC')